storage/app/step83-load-results/20260517-233731/baseline_dashboard_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/dashboard/summary
Document Length:        692 bytes

Concurrency Level:      20
Time taken for tests:   2.113 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      204190 bytes
HTML transferred:       138400 bytes
Requests per second:    94.67 [#/sec] (mean)
Time per request:       211.260 [ms] (mean)
Time per request:       10.563 [ms] (mean, across all concurrent requests)
Transfer rate:          94.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    26  199  32.8    204     250
Waiting:       25  199  32.8    204     250
Total:         26  200  32.7    204     251

Percentage of the requests served within a certain time (ms)
  50%    204
  66%    212
  75%    217
  80%    219
  90%    229
  95%    234
  98%    239
  99%    249
 100%    251 (longest request)