storage/app/step83-load-results/20260517-233731/baseline_health_hydration_daily.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/hydration/summary/daily
Document Length:        186 bytes

Concurrency Level:      20
Time taken for tests:   2.793 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      103033 bytes
HTML transferred:       37200 bytes
Requests per second:    71.61 [#/sec] (mean)
Time per request:       279.276 [ms] (mean)
Time per request:       13.964 [ms] (mean, across all concurrent requests)
Transfer rate:          36.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    48  263  54.2    266     403
Waiting:       46  263  54.3    266     403
Total:         48  263  54.1    266     403

Percentage of the requests served within a certain time (ms)
  50%    266
  66%    273
  75%    280
  80%    286
  90%    325
  95%    350
  98%    372
  99%    384
 100%    403 (longest request)