storage/app/step83-load-results/20260517-233731/baseline_productivity_dashboard.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/productivity/dashboard
Document Length:        1907 bytes

Concurrency Level:      20
Time taken for tests:   2.705 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      447193 bytes
HTML transferred:       381400 bytes
Requests per second:    73.95 [#/sec] (mean)
Time per request:       270.460 [ms] (mean)
Time per request:       13.523 [ms] (mean, across all concurrent requests)
Transfer rate:          161.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    45  255  54.8    257     411
Waiting:       43  255  54.7    257     408
Total:         45  255  54.6    258     411

Percentage of the requests served within a certain time (ms)
  50%    258
  66%    270
  75%    278
  80%    284
  90%    307
  95%    339
  98%    371
  99%    391
 100%    411 (longest request)