storage/app/step83-load-results/20260517-233731/smoke_ai_recommendations.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/ai/recommendations
Document Length:        199 bytes

Concurrency Level:      5
Time taken for tests:   0.591 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      26405 bytes
HTML transferred:       9950 bytes
Requests per second:    84.61 [#/sec] (mean)
Time per request:       59.093 [ms] (mean)
Time per request:       11.819 [ms] (mean, across all concurrent requests)
Transfer rate:          43.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    28   55  12.2     55      80
Waiting:       27   55  12.2     55      80
Total:         28   55  12.2     55      80

Percentage of the requests served within a certain time (ms)
  50%     55
  66%     61
  75%     62
  80%     65
  90%     73
  95%     75
  98%     80
  99%     80
 100%     80 (longest request)