storage/app/step83-load-results/20260517-233731/stress_finance_budgets.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/finance/budgets
Document Length:        70 bytes

Concurrency Level:      50
Time taken for tests:   5.600 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      199496 bytes
HTML transferred:       35000 bytes
Requests per second:    89.28 [#/sec] (mean)
Time per request:       560.029 [ms] (mean)
Time per request:       11.201 [ms] (mean, across all concurrent requests)
Transfer rate:          34.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       5
Processing:    -2  572 231.4    642     846
Waiting:        0  572 231.3    642     846
Total:          0  573 231.0    642     846

Percentage of the requests served within a certain time (ms)
  50%    642
  66%    674
  75%    711
  80%    721
  90%    750
  95%    774
  98%    812
  99%    827
 100%    846 (longest request)