storage/app/step83-load-results/20260517-233731/stress_health_nutrition_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/nutrition/summary
Document Length:        420 bytes

Concurrency Level:      50
Time taken for tests:   7.323 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      374492 bytes
HTML transferred:       210000 bytes
Requests per second:    68.28 [#/sec] (mean)
Time per request:       732.286 [ms] (mean)
Time per request:       14.646 [ms] (mean, across all concurrent requests)
Transfer rate:          49.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.6      0       7
Processing:    45  696 180.0    675    1154
Waiting:       45  695 180.0    675    1154
Total:         51  696 179.1    675    1154

Percentage of the requests served within a certain time (ms)
  50%    675
  66%    726
  75%    754
  80%    790
  90%    919
  95%   1063
  98%   1105
  99%   1114
 100%   1154 (longest request)