storage/app/step83-load-results/20260517-233731/stress_life_balance_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/life-balance/summary
Document Length:        649 bytes

Concurrency Level:      50
Time taken for tests:   6.755 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      488979 bytes
HTML transferred:       324500 bytes
Requests per second:    74.02 [#/sec] (mean)
Time per request:       675.463 [ms] (mean)
Time per request:       13.509 [ms] (mean, across all concurrent requests)
Transfer rate:          70.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.6      0       7
Processing:    58  626 123.3    645     788
Waiting:       58  626 123.3    645     787
Total:         59  627 122.3    645     788

Percentage of the requests served within a certain time (ms)
  50%    645
  66%    672
  75%    688
  80%    698
  90%    723
  95%    745
  98%    765
  99%    775
 100%    788 (longest request)